[
    {
        "id": "150488099",
        "title": "cardiac-open-heart-surgery",
        "content": "Has anyone with metastatic breast cancer had open heart cardiac surgery and might you share your experience with me please?  I only saw my surgeon yesterday and am now scheduled for Monday.  How amazing is that but I'm just a bit scared. It's one of those 'be careful what you wish for' situations as I've wanted  my heart to work properly for years  but now it's finally here, it's like OMG - should i be having it, is it going to make things worse? I've not had palbociclib for several weeks already because of  a post-covid cold which the surgeons aren't too bothered about but it means I won't be having palbo for several more weeks until healed and I'm 2.3 yrs into palbo/letrozole treatment . Any helpful suggestions/reflections to ease my troubled mind would be most welcome.</",
        "date": "TODO",
        "username": "bikebabe"
    },
    {
        "id": "150488059",
        "title": "stop-taking-ibrance",
        "content": "I just had an interesting meeting with my Onc. She asked me if I would consider going off ibranch because I have been stable ever since I started to take it five and a half years ago. I was shocked. I didn't know what to say other than I feel more secure staying on it. She said that there are clinical trials trying to test whether or not it's beneficial after so many years of being stable. Does anyone have any information about this or any experience in this area?.</",
        "date": "TODO",
        "username": "mudakurag"
    },
    {
        "id": "150487374",
        "title": "cross-road",
        "content": "Thank you for listening 💕</",
        "date": "TODO",
        "username": "Kcap430"
    },
    {
        "id": "150486764",
        "title": "fuervesant-shots",
        "content": "Has anyone done the shots they could give me any advice???</",
        "date": "TODO",
        "username": "Barreds"
    },
    {
        "id": "150484137",
        "title": "hip-pain-from-faslodex",
        "content": "I did post this on a reply to another post but I’m not sure if anyone will see it……..does anyone have hip pain after faslodex. . I have been on this for a handful of years and the hip pain just started within the last 4 months. No problems at the injection site. This is specially my hip. Initially it was just one hip-concerning enough that they did a MRI. Now it’s both hips. I finally noticed the correlation that it ramps up after a shot. It actually hurts so bad it feels like I have damaged the joint or the muscle is not strong enough for me to walk at times.  The sharpness of the pain will stop you in your tracks and I have almost fallen several times because of this. Anyone have this?  What helps to make this stop? </",
        "date": "TODO",
        "username": "Fight2016"
    },
    {
        "id": "150484062",
        "title": "enhertu-side-effect-pneumonitis-lung-inflammation",
        "content": "Thanks and best wishes ...</",
        "date": "TODO",
        "username": "LDR1"
    },
    {
        "id": "150483580",
        "title": "low-neutrophil",
        "content": "Any thoughts?</",
        "date": "TODO",
        "username": "jltorcz"
    },
    {
        "id": "150482274",
        "title": "good-morning",
        "content": "Ps I found so many cute hats on Amazon. Google chemo hats for women.  Sending lots of prayers.  </",
        "date": "TODO",
        "username": "BaileyJames"
    },
    {
        "id": "150477300",
        "title": "the-dare-trial-anyone-familiar-with-it-been-in-it",
        "content": "the trial is ongoing screening of your blood every 6 months, checking for ctDNA ( cancer tumor DNA)....if it is found you begin a treatment regimen...if not they just continue to screen you for 2 years...any thoughts? In my mind this should be the future of cancer detection as it finds the disease at microscopic levels...not when it has grown to be visible on mammograms....</",
        "date": "TODO",
        "username": "Drrob81"
    },
    {
        "id": "150476135",
        "title": "ibrance-and-bruising",
        "content": "I have been on Ibrance and Letrozole for 6 years now with NED!!!  I'm so grateful for that and counting on many more!   I'm wondering if any others of you on that protocol have issues with cyclical bruising.  I get tons of bruises on my hands and arms at the END of my week off of Ibrance.  It will all settle down again about 10 days later as the Ibrance builds up in my system again.  After about 18 bruise free days, it all starts again.  Anyone else having similar issues?  </",
        "date": "TODO",
        "username": "Mermaiden"
    }
]